export const repairListBoard = [
  {
    id: 0,
    title: 'Разбор корпуса',
    description: 'Корпус необходимо разобрать, прежде чем приступить к работе',
    price: '550',
    category: 'Ремонт клавиатуры',
  },
  {
    id: 1,
    title: 'Замена разъёма подключения',
    description: 'Провод плохо сидит в разъёме, неустойчивый контакт или его полное отсутствие',
    price: '1110',
    category: 'Ремонт клавиатуры',
  },
  {
    id: 2,
    title: 'Замена переключателей',
    description:
      'Один или несколько переключателей не работают или требуется другой вид переключателей',
    price: '550',
    category: 'Ремонт клавиатуры',
  },
  {
    id: 3,
    title: 'Чистка клавиатуры',
    description:
      'Устройство было залито жидкостью, покрылось пылью или попало под другой вид загрязнений',
    price: '890',
    category: 'Ремонт клавиатуры',
  },
  {
    id: 4,
    title: 'Замена контроллера',
    description: 'Клавиатура не работает или ведёт себя очень странно',
    price: '3000',
    category: 'Ремонт клавиатуры',
  },
  {
    id: 5,
    title: 'Замена корпуса',
    description:
      'Корпус клавиатуры получил критические повреждения и не подлежит ремонту или требуется аналогичный корпус другого цвета',
    price: '2000',
    category: 'Ремонт клавиатуры',
  },
];

export const upgradeList = [
  {
    id: 6,
    title: 'Смазка переключателей',
    description: 'Уменьшение механического скрипа и звона пружин',
    price: '3100',
    category: 'Апгрейд',
  },
  {
    id: 7,
    title: 'Замена стабилизаторов',
    description: 'Длинные клавиши шумят, дребезжат, цокают или издают прочие лишние звуки',
    price: '3100',
    category: 'Апгрейд',
  },
  {
    id: 8,
    title: 'Установка шумоизоляции',
    description: 'Необходимо уменьшить шум клавиатуры',
    price: '490',
    category: 'Апгрейд',
  },
  {
    id: 9,
    title: 'Установка конвертера',
    description: 'Перевод ретро клавиатуры со старого штекера на USB',
    price: '4200',
    category: 'Апгрейд',
  },
];

export const repairListMice = [
  {
    id: 10,
    title: 'Замена энкодера колеса',
    description: 'Прокрутка колесом не работает или работает некорректно',
    price: '790',
    category: 'Ремонт мышки',
  },
  {
    id: 11,
    title: 'Замена микрика',
    description: 'Мышь не реагирует на нажатия, не издаёт клик или возникает двойное срабатывание',
    price: '590',
    category: 'Ремонт мышки',
  },
];
